# PartMaker Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Part..::..PartMaker Property
Part Class See Also
---
The PartMaker that created this Part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public PartMaker PartMaker { get; }
```

Visual Basic
---
```text
Public ReadOnly Property PartMaker As PartMaker
	Get
```

Visual C++
---
```text
public:
property PartMaker^ PartMaker {
	PartMaker^ get ();
}
```

# See Also
Part Class
Autodesk.Revit.DB Namespace